using System;

namespace EnumFlagTest2
{
    internal class Program
    {
        [Flags]
        internal enum WarnType1
        {
            高温报警 = 0b_0000_0000_0000_0001,
            低温报警 = 0b_0000_0000_0000_0010,
            断电报警 = 0b_0000_0000_0000_0100,
            开门报警 = 0b_0000_0000_0000_1000,
            环温传感器故障 = 0b_0000_0000_0001_0000,
            PT100主传感器故障 = 0b_0000_0000_0010_0000,
            热交换传感器故障 = 0b_0000_0000_0100_0000,
            冷凝器传感器故障 = 0b_0000_0000_1000_0000,
            后备系统PT100故障 = 0b_0000_0001_0000_0000,
            冷凝器脏报警 = 0b_0000_0010_0000_0000,
            环温过高报警 = 0b_0000_0100_0000_0000,
            电池插反 = 0b_0000_1000_0000_0000,
            电池未连接 = 0b_0001_0000_0000_0000,
            电池电量低 = 0b_0010_0000_0000_0000,
            电源板故障 = 0b_0100_0000_0000_0000,
            电压超标 = 0b_1000_0000_0000_0000,
        }

        private static void Main(string[] args)
        {
            Console.WriteLine((WarnType1)127);
        }
    }
}